espressif/esp-idf/components/soc/esp32s31/register/soc/adc_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** ADC_CTRL0_REG register
 *  Register
 */
#define ADC_CTRL0_REG (DR_REG_ADC_BASE + 0x0)
/** ADC_SAR1_TRIGGER_STOP : WT; bitpos: [0]; default: 0;
 *  need_des
 */
#define ADC_SAR1_TRIGGER_STOP    (BIT(0))
#define ADC_SAR1_TRIGGER_STOP_M  (ADC_SAR1_TRIGGER_STOP_V << ADC_SAR1_TRIGGER_STOP_S)
#define ADC_SAR1_TRIGGER_STOP_V  0x00000001U
#define ADC_SAR1_TRIGGER_STOP_S  0
/** ADC_SAR1_TRIGGER_START : WT; bitpos: [1]; default: 0;
 *  need_des
 */
#define ADC_SAR1_TRIGGER_START    (BIT(1))
#define ADC_SAR1_TRIGGER_START_M  (ADC_SAR1_TRIGGER_START_V << ADC_SAR1_TRIGGER_START_S)
#define ADC_SAR1_TRIGGER_START_V  0x00000001U
#define ADC_SAR1_TRIGGER_START_S  1
/** ADC_SAR1_TRIGGER_MODE : R/W; bitpos: [3:2]; default: 0;
 *  SAR clock divider
 */
#define ADC_SAR1_TRIGGER_MODE    0x00000003U
#define ADC_SAR1_TRIGGER_MODE_M  (ADC_SAR1_TRIGGER_MODE_V << ADC_SAR1_TRIGGER_MODE_S)
#define ADC_SAR1_TRIGGER_MODE_V  0x00000003U
#define ADC_SAR1_TRIGGER_MODE_S  2
/** ADC_SAR1_PATT_LEN : R/W; bitpos: [17:14]; default: 15;
 *  0 ~ 15 means length 1 ~ 16
 */
#define ADC_SAR1_PATT_LEN    0x0000000FU
#define ADC_SAR1_PATT_LEN_M  (ADC_SAR1_PATT_LEN_V << ADC_SAR1_PATT_LEN_S)
#define ADC_SAR1_PATT_LEN_V  0x0000000FU
#define ADC_SAR1_PATT_LEN_S  14
/** ADC_SAR1_PATT_P_CLEAR : WT; bitpos: [22]; default: 0;
 *  clear the pointer of pattern table for DIG ADC1 CTRL
 */
#define ADC_SAR1_PATT_P_CLEAR    (BIT(22))
#define ADC_SAR1_PATT_P_CLEAR_M  (ADC_SAR1_PATT_P_CLEAR_V << ADC_SAR1_PATT_P_CLEAR_S)
#define ADC_SAR1_PATT_P_CLEAR_V  0x00000001U
#define ADC_SAR1_PATT_P_CLEAR_S  22
/** ADC_SAR1_PATT_TYPE : R/W; bitpos: [23]; default: 0;
 *  1: select meas start as table update 0:select mead done as table update
 */
#define ADC_SAR1_PATT_TYPE    (BIT(23))
#define ADC_SAR1_PATT_TYPE_M  (ADC_SAR1_PATT_TYPE_V << ADC_SAR1_PATT_TYPE_S)
#define ADC_SAR1_PATT_TYPE_V  0x00000001U
#define ADC_SAR1_PATT_TYPE_S  23
/** ADC_SAR1_CLK_POS_SEL : R/W; bitpos: [24]; default: 0;
 *  1: sar_sel will be coded by the MSB of the 16-bit output data, in this case the
 *  resolution should not be larger than 11 bits.
 */
#define ADC_SAR1_CLK_POS_SEL    (BIT(24))
#define ADC_SAR1_CLK_POS_SEL_M  (ADC_SAR1_CLK_POS_SEL_V << ADC_SAR1_CLK_POS_SEL_S)
#define ADC_SAR1_CLK_POS_SEL_V  0x00000001U
#define ADC_SAR1_CLK_POS_SEL_S  24
/** ADC_SAR1_CONTINUE_MODE_EN : R/W; bitpos: [25]; default: 0;
 *  1: I2S input data is from SAR ADC (for DMA), 0: I2S input data is from GPIO matrix
 */
#define ADC_SAR1_CONTINUE_MODE_EN    (BIT(25))
#define ADC_SAR1_CONTINUE_MODE_EN_M  (ADC_SAR1_CONTINUE_MODE_EN_V << ADC_SAR1_CONTINUE_MODE_EN_S)
#define ADC_SAR1_CONTINUE_MODE_EN_V  0x00000001U
#define ADC_SAR1_CONTINUE_MODE_EN_S  25
/** ADC_XPD_SAR1_FORCE : R/W; bitpos: [27:26]; default: 0;
 *  force option to xpd sar1 blocks
 */
#define ADC_XPD_SAR1_FORCE    0x00000003U
#define ADC_XPD_SAR1_FORCE_M  (ADC_XPD_SAR1_FORCE_V << ADC_XPD_SAR1_FORCE_S)
#define ADC_XPD_SAR1_FORCE_V  0x00000003U
#define ADC_XPD_SAR1_FORCE_S  26

/** ADC_CTRL1_REG register
 *  Register
 */
#define ADC_CTRL1_REG (DR_REG_ADC_BASE + 0x4)
/** ADC_SAR2_TRIGGER_STOP : WT; bitpos: [0]; default: 0;
 *  need_des
 */
#define ADC_SAR2_TRIGGER_STOP    (BIT(0))
#define ADC_SAR2_TRIGGER_STOP_M  (ADC_SAR2_TRIGGER_STOP_V << ADC_SAR2_TRIGGER_STOP_S)
#define ADC_SAR2_TRIGGER_STOP_V  0x00000001U
#define ADC_SAR2_TRIGGER_STOP_S  0
/** ADC_SAR2_TRIGGER_START : WT; bitpos: [1]; default: 0;
 *  need_des
 */
#define ADC_SAR2_TRIGGER_START    (BIT(1))
#define ADC_SAR2_TRIGGER_START_M  (ADC_SAR2_TRIGGER_START_V << ADC_SAR2_TRIGGER_START_S)
#define ADC_SAR2_TRIGGER_START_V  0x00000001U
#define ADC_SAR2_TRIGGER_START_S  1
/** ADC_SAR2_TRIGGER_MODE : R/W; bitpos: [3:2]; default: 0;
 *  SAR clock divider
 */
#define ADC_SAR2_TRIGGER_MODE    0x00000003U
#define ADC_SAR2_TRIGGER_MODE_M  (ADC_SAR2_TRIGGER_MODE_V << ADC_SAR2_TRIGGER_MODE_S)
#define ADC_SAR2_TRIGGER_MODE_V  0x00000003U
#define ADC_SAR2_TRIGGER_MODE_S  2
/** ADC_SAR2_PATT_LEN : R/W; bitpos: [17:14]; default: 15;
 *  0 ~ 15 means length 1 ~ 16
 */
#define ADC_SAR2_PATT_LEN    0x0000000FU
#define ADC_SAR2_PATT_LEN_M  (ADC_SAR2_PATT_LEN_V << ADC_SAR2_PATT_LEN_S)
#define ADC_SAR2_PATT_LEN_V  0x0000000FU
#define ADC_SAR2_PATT_LEN_S  14
/** ADC_SAR2_PATT_P_CLEAR : WT; bitpos: [22]; default: 0;
 *  clear the pointer of pattern table for DIG ADC1 CTRL
 */
#define ADC_SAR2_PATT_P_CLEAR    (BIT(22))
#define ADC_SAR2_PATT_P_CLEAR_M  (ADC_SAR2_PATT_P_CLEAR_V << ADC_SAR2_PATT_P_CLEAR_S)
#define ADC_SAR2_PATT_P_CLEAR_V  0x00000001U
#define ADC_SAR2_PATT_P_CLEAR_S  22
/** ADC_SAR2_PATT_TYPE : R/W; bitpos: [23]; default: 0;
 *  1: select meas start as table update 0:select mead done as table update
 */
#define ADC_SAR2_PATT_TYPE    (BIT(23))
#define ADC_SAR2_PATT_TYPE_M  (ADC_SAR2_PATT_TYPE_V << ADC_SAR2_PATT_TYPE_S)
#define ADC_SAR2_PATT_TYPE_V  0x00000001U
#define ADC_SAR2_PATT_TYPE_S  23
/** ADC_SAR2_CLK_POS_SEL : R/W; bitpos: [24]; default: 0;
 *  1: sar_sel will be coded by the MSB of the 16-bit output data, in this case the
 *  resolution should not be larger than 11 bits.
 */
#define ADC_SAR2_CLK_POS_SEL    (BIT(24))
#define ADC_SAR2_CLK_POS_SEL_M  (ADC_SAR2_CLK_POS_SEL_V << ADC_SAR2_CLK_POS_SEL_S)
#define ADC_SAR2_CLK_POS_SEL_V  0x00000001U
#define ADC_SAR2_CLK_POS_SEL_S  24
/** ADC_SAR2_CONTINUE_MODE_EN : R/W; bitpos: [25]; default: 0;
 *  1: I2S input data is from SAR ADC (for DMA), 0: I2S input data is from GPIO matrix
 */
#define ADC_SAR2_CONTINUE_MODE_EN    (BIT(25))
#define ADC_SAR2_CONTINUE_MODE_EN_M  (ADC_SAR2_CONTINUE_MODE_EN_V << ADC_SAR2_CONTINUE_MODE_EN_S)
#define ADC_SAR2_CONTINUE_MODE_EN_V  0x00000001U
#define ADC_SAR2_CONTINUE_MODE_EN_S  25
/** ADC_XPD_SAR2_FORCE : R/W; bitpos: [27:26]; default: 0;
 *  force option to xpd sar1 blocks
 */
#define ADC_XPD_SAR2_FORCE    0x00000003U
#define ADC_XPD_SAR2_FORCE_M  (ADC_XPD_SAR2_FORCE_V << ADC_XPD_SAR2_FORCE_S)
#define ADC_XPD_SAR2_FORCE_V  0x00000003U
#define ADC_XPD_SAR2_FORCE_S  26

/** ADC_CTRL2_REG register
 *  Register
 */
#define ADC_CTRL2_REG (DR_REG_ADC_BASE + 0x8)
/** ADC_TIMER_TARGET : R/W; bitpos: [23:12]; default: 10;
 *  to set saradc timer target
 */
#define ADC_TIMER_TARGET    0x00000FFFU
#define ADC_TIMER_TARGET_M  (ADC_TIMER_TARGET_V << ADC_TIMER_TARGET_S)
#define ADC_TIMER_TARGET_V  0x00000FFFU
#define ADC_TIMER_TARGET_S  12
/** ADC_TIMER_EN : R/W; bitpos: [24]; default: 0;
 *  to enable saradc timer trigger
 */
#define ADC_TIMER_EN    (BIT(24))
#define ADC_TIMER_EN_M  (ADC_TIMER_EN_V << ADC_TIMER_EN_S)
#define ADC_TIMER_EN_V  0x00000001U
#define ADC_TIMER_EN_S  24

/** ADC_FILTER_CTRL1_REG register
 *  Register
 */
#define ADC_FILTER_CTRL1_REG (DR_REG_ADC_BASE + 0xc)
/** ADC_FILTER_FACTOR1 : R/W; bitpos: [28:26]; default: 0;
 *  need_des
 */
#define ADC_FILTER_FACTOR1    0x00000007U
#define ADC_FILTER_FACTOR1_M  (ADC_FILTER_FACTOR1_V << ADC_FILTER_FACTOR1_S)
#define ADC_FILTER_FACTOR1_V  0x00000007U
#define ADC_FILTER_FACTOR1_S  26
/** ADC_FILTER_FACTOR0 : R/W; bitpos: [31:29]; default: 0;
 *  need_des
 */
#define ADC_FILTER_FACTOR0    0x00000007U
#define ADC_FILTER_FACTOR0_M  (ADC_FILTER_FACTOR0_V << ADC_FILTER_FACTOR0_S)
#define ADC_FILTER_FACTOR0_V  0x00000007U
#define ADC_FILTER_FACTOR0_S  29

/** ADC_SAR1_PATT_TAB1_REG register
 *  Register
 */
#define ADC_SAR1_PATT_TAB1_REG (DR_REG_ADC_BASE + 0x1c)
/** ADC_SAR1_PATT_TAB1 : R/W; bitpos: [23:0]; default: 15728640;
 *  item 0 ~ 3 for pattern table 1 (each item one byte)
 */
#define ADC_SAR1_PATT_TAB1    0x00FFFFFFU
#define ADC_SAR1_PATT_TAB1_M  (ADC_SAR1_PATT_TAB1_V << ADC_SAR1_PATT_TAB1_S)
#define ADC_SAR1_PATT_TAB1_V  0x00FFFFFFU
#define ADC_SAR1_PATT_TAB1_S  0

/** ADC_SAR1_PATT_TAB2_REG register
 *  Register
 */
#define ADC_SAR1_PATT_TAB2_REG (DR_REG_ADC_BASE + 0x20)
/** ADC_SAR1_PATT_TAB2 : R/W; bitpos: [23:0]; default: 0;
 *  Item 4 ~ 7 for pattern table 1 (each item one byte)
 */
#define ADC_SAR1_PATT_TAB2    0x00FFFFFFU
#define ADC_SAR1_PATT_TAB2_M  (ADC_SAR1_PATT_TAB2_V << ADC_SAR1_PATT_TAB2_S)
#define ADC_SAR1_PATT_TAB2_V  0x00FFFFFFU
#define ADC_SAR1_PATT_TAB2_S  0

/** ADC_SAR1_PATT_TAB3_REG register
 *  Register
 */
#define ADC_SAR1_PATT_TAB3_REG (DR_REG_ADC_BASE + 0x24)
/** ADC_SAR1_PATT_TAB3 : R/W; bitpos: [23:0]; default: 0;
 *  Item 8 ~ 11 for pattern table 1 (each item one byte)
 */
#define ADC_SAR1_PATT_TAB3    0x00FFFFFFU
#define ADC_SAR1_PATT_TAB3_M  (ADC_SAR1_PATT_TAB3_V << ADC_SAR1_PATT_TAB3_S)
#define ADC_SAR1_PATT_TAB3_V  0x00FFFFFFU
#define ADC_SAR1_PATT_TAB3_S  0

/** ADC_SAR1_PATT_TAB4_REG register
 *  Register
 */
#define ADC_SAR1_PATT_TAB4_REG (DR_REG_ADC_BASE + 0x28)
/** ADC_SAR1_PATT_TAB4 : R/W; bitpos: [23:0]; default: 0;
 *  Item 12 ~ 15 for pattern table 1 (each item one byte)
 */
#define ADC_SAR1_PATT_TAB4    0x00FFFFFFU
#define ADC_SAR1_PATT_TAB4_M  (ADC_SAR1_PATT_TAB4_V << ADC_SAR1_PATT_TAB4_S)
#define ADC_SAR1_PATT_TAB4_V  0x00FFFFFFU
#define ADC_SAR1_PATT_TAB4_S  0

/** ADC_SAR2_PATT_TAB1_REG register
 *  Register
 */
#define ADC_SAR2_PATT_TAB1_REG (DR_REG_ADC_BASE + 0x2c)
/** ADC_SAR2_PATT_TAB1 : R/W; bitpos: [23:0]; default: 15728640;
 *  item 0 ~ 3 for pattern table 2 (each item one byte)
 */
#define ADC_SAR2_PATT_TAB1    0x00FFFFFFU
#define ADC_SAR2_PATT_TAB1_M  (ADC_SAR2_PATT_TAB1_V << ADC_SAR2_PATT_TAB1_S)
#define ADC_SAR2_PATT_TAB1_V  0x00FFFFFFU
#define ADC_SAR2_PATT_TAB1_S  0

/** ADC_SAR2_PATT_TAB2_REG register
 *  Register
 */
#define ADC_SAR2_PATT_TAB2_REG (DR_REG_ADC_BASE + 0x30)
/** ADC_SAR2_PATT_TAB2 : R/W; bitpos: [23:0]; default: 0;
 *  Item 4 ~ 7 for pattern table 2 (each item one byte)
 */
#define ADC_SAR2_PATT_TAB2    0x00FFFFFFU
#define ADC_SAR2_PATT_TAB2_M  (ADC_SAR2_PATT_TAB2_V << ADC_SAR2_PATT_TAB2_S)
#define ADC_SAR2_PATT_TAB2_V  0x00FFFFFFU
#define ADC_SAR2_PATT_TAB2_S  0

/** ADC_SAR2_PATT_TAB3_REG register
 *  Register
 */
#define ADC_SAR2_PATT_TAB3_REG (DR_REG_ADC_BASE + 0x34)
/** ADC_SAR2_PATT_TAB3 : R/W; bitpos: [23:0]; default: 0;
 *  Item 8 ~ 11 for pattern table 2 (each item one byte)
 */
#define ADC_SAR2_PATT_TAB3    0x00FFFFFFU
#define ADC_SAR2_PATT_TAB3_M  (ADC_SAR2_PATT_TAB3_V << ADC_SAR2_PATT_TAB3_S)
#define ADC_SAR2_PATT_TAB3_V  0x00FFFFFFU
#define ADC_SAR2_PATT_TAB3_S  0

/** ADC_SAR2_PATT_TAB4_REG register
 *  Register
 */
#define ADC_SAR2_PATT_TAB4_REG (DR_REG_ADC_BASE + 0x38)
/** ADC_SAR2_PATT_TAB4 : R/W; bitpos: [23:0]; default: 0;
 *  Item 12 ~ 15 for pattern table 2 (each item one byte)
 */
#define ADC_SAR2_PATT_TAB4    0x00FFFFFFU
#define ADC_SAR2_PATT_TAB4_M  (ADC_SAR2_PATT_TAB4_V << ADC_SAR2_PATT_TAB4_S)
#define ADC_SAR2_PATT_TAB4_V  0x00FFFFFFU
#define ADC_SAR2_PATT_TAB4_S  0

