espressif/esp-idf/components/soc/esp32s31/register/soc/adc_reg.h
/** ADC_INT_ST_REG register
 *  Register
 */
#define ADC_INT_ST_REG (DR_REG_ADC_BASE + 0x6c)
/** ADC_FIFO_OVERFLOW_INT_ST : RO; bitpos: [25]; default: 0;
 *  need_des
 */
#define ADC_FIFO_OVERFLOW_INT_ST    (BIT(25))
#define ADC_FIFO_OVERFLOW_INT_ST_M  (ADC_FIFO_OVERFLOW_INT_ST_V << ADC_FIFO_OVERFLOW_INT_ST_S)
#define ADC_FIFO_OVERFLOW_INT_ST_V  0x00000001U
#define ADC_FIFO_OVERFLOW_INT_ST_S  25
/** ADC_THRES1_LOW_INT_ST : RO; bitpos: [26]; default: 0;
 *  need_des
 */
#define ADC_THRES1_LOW_INT_ST    (BIT(26))
#define ADC_THRES1_LOW_INT_ST_M  (ADC_THRES1_LOW_INT_ST_V << ADC_THRES1_LOW_INT_ST_S)
#define ADC_THRES1_LOW_INT_ST_V  0x00000001U
#define ADC_THRES1_LOW_INT_ST_S  26
/** ADC_THRES0_LOW_INT_ST : RO; bitpos: [27]; default: 0;
 *  need_des
 */
#define ADC_THRES0_LOW_INT_ST    (BIT(27))
#define ADC_THRES0_LOW_INT_ST_M  (ADC_THRES0_LOW_INT_ST_V << ADC_THRES0_LOW_INT_ST_S)
#define ADC_THRES0_LOW_INT_ST_V  0x00000001U
#define ADC_THRES0_LOW_INT_ST_S  27
/** ADC_THRES1_HIGH_INT_ST : RO; bitpos: [28]; default: 0;
 *  need_des
 */
#define ADC_THRES1_HIGH_INT_ST    (BIT(28))
#define ADC_THRES1_HIGH_INT_ST_M  (ADC_THRES1_HIGH_INT_ST_V << ADC_THRES1_HIGH_INT_ST_S)
#define ADC_THRES1_HIGH_INT_ST_V  0x00000001U
#define ADC_THRES1_HIGH_INT_ST_S  28
/** ADC_THRES0_HIGH_INT_ST : RO; bitpos: [29]; default: 0;
 *  need_des
 */
#define ADC_THRES0_HIGH_INT_ST    (BIT(29))
#define ADC_THRES0_HIGH_INT_ST_M  (ADC_THRES0_HIGH_INT_ST_V << ADC_THRES0_HIGH_INT_ST_S)
#define ADC_THRES0_HIGH_INT_ST_V  0x00000001U
#define ADC_THRES0_HIGH_INT_ST_S  29
/** ADC_SAR2_DONE_INT_ST : RO; bitpos: [30]; default: 0;
 *  need_des
 */
#define ADC_SAR2_DONE_INT_ST    (BIT(30))
#define ADC_SAR2_DONE_INT_ST_M  (ADC_SAR2_DONE_INT_ST_V << ADC_SAR2_DONE_INT_ST_S)
#define ADC_SAR2_DONE_INT_ST_V  0x00000001U
#define ADC_SAR2_DONE_INT_ST_S  30
/** ADC_SAR1_DONE_INT_ST : RO; bitpos: [31]; default: 0;
 *  need_des
 */
#define ADC_SAR1_DONE_INT_ST    (BIT(31))
#define ADC_SAR1_DONE_INT_ST_M  (ADC_SAR1_DONE_INT_ST_V << ADC_SAR1_DONE_INT_ST_S)
#define ADC_SAR1_DONE_INT_ST_V  0x00000001U
#define ADC_SAR1_DONE_INT_ST_S  31

/** ADC_INT_CLR_REG register
 *  Register
 */
#define ADC_INT_CLR_REG (DR_REG_ADC_BASE + 0x70)
/** ADC_FIFO_OVERFLOW_INT_CLR : WT; bitpos: [25]; default: 0;
 *  need_des
 */
#define ADC_FIFO_OVERFLOW_INT_CLR    (BIT(25))
#define ADC_FIFO_OVERFLOW_INT_CLR_M  (ADC_FIFO_OVERFLOW_INT_CLR_V << ADC_FIFO_OVERFLOW_INT_CLR_S)
#define ADC_FIFO_OVERFLOW_INT_CLR_V  0x00000001U
#define ADC_FIFO_OVERFLOW_INT_CLR_S  25
/** ADC_THRES1_LOW_INT_CLR : WT; bitpos: [26]; default: 0;
 *  need_des
 */
#define ADC_THRES1_LOW_INT_CLR    (BIT(26))
#define ADC_THRES1_LOW_INT_CLR_M  (ADC_THRES1_LOW_INT_CLR_V << ADC_THRES1_LOW_INT_CLR_S)
#define ADC_THRES1_LOW_INT_CLR_V  0x00000001U
#define ADC_THRES1_LOW_INT_CLR_S  26
/** ADC_THRES0_LOW_INT_CLR : WT; bitpos: [27]; default: 0;
 *  need_des
 */
#define ADC_THRES0_LOW_INT_CLR    (BIT(27))
#define ADC_THRES0_LOW_INT_CLR_M  (ADC_THRES0_LOW_INT_CLR_V << ADC_THRES0_LOW_INT_CLR_S)
#define ADC_THRES0_LOW_INT_CLR_V  0x00000001U
#define ADC_THRES0_LOW_INT_CLR_S  27
/** ADC_THRES1_HIGH_INT_CLR : WT; bitpos: [28]; default: 0;
 *  need_des
 */
#define ADC_THRES1_HIGH_INT_CLR    (BIT(28))
#define ADC_THRES1_HIGH_INT_CLR_M  (ADC_THRES1_HIGH_INT_CLR_V << ADC_THRES1_HIGH_INT_CLR_S)
#define ADC_THRES1_HIGH_INT_CLR_V  0x00000001U
#define ADC_THRES1_HIGH_INT_CLR_S  28
/** ADC_THRES0_HIGH_INT_CLR : WT; bitpos: [29]; default: 0;
 *  need_des
 */
#define ADC_THRES0_HIGH_INT_CLR    (BIT(29))
#define ADC_THRES0_HIGH_INT_CLR_M  (ADC_THRES0_HIGH_INT_CLR_V << ADC_THRES0_HIGH_INT_CLR_S)
#define ADC_THRES0_HIGH_INT_CLR_V  0x00000001U
#define ADC_THRES0_HIGH_INT_CLR_S  29
/** ADC_SAR2_DONE_INT_CLR : WT; bitpos: [30]; default: 0;
 *  need_des
 */
#define ADC_SAR2_DONE_INT_CLR    (BIT(30))
#define ADC_SAR2_DONE_INT_CLR_M  (ADC_SAR2_DONE_INT_CLR_V << ADC_SAR2_DONE_INT_CLR_S)
#define ADC_SAR2_DONE_INT_CLR_V  0x00000001U
#define ADC_SAR2_DONE_INT_CLR_S  30
/** ADC_SAR1_DONE_INT_CLR : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define ADC_SAR1_DONE_INT_CLR    (BIT(31))
#define ADC_SAR1_DONE_INT_CLR_M  (ADC_SAR1_DONE_INT_CLR_V << ADC_SAR1_DONE_INT_CLR_S)
#define ADC_SAR1_DONE_INT_CLR_V  0x00000001U
#define ADC_SAR1_DONE_INT_CLR_S  31

/** ADC_DMA_CONF_REG register
 *  Register
 */
#define ADC_DMA_CONF_REG (DR_REG_ADC_BASE + 0x74)
/** ADC_APB_ADC_EOF_NUM : R/W; bitpos: [15:0]; default: 255;
 *  the dma_in_suc_eof gen when sample cnt = spi_eof_num
 */
#define ADC_APB_ADC_EOF_NUM    0x0000FFFFU
#define ADC_APB_ADC_EOF_NUM_M  (ADC_APB_ADC_EOF_NUM_V << ADC_APB_ADC_EOF_NUM_S)
#define ADC_APB_ADC_EOF_NUM_V  0x0000FFFFU
#define ADC_APB_ADC_EOF_NUM_S  0
/** ADC_DMA_EOF_NUM_CLR : WT; bitpos: [16]; default: 0;
 *  clear eof cnt
 */
#define ADC_DMA_EOF_NUM_CLR    (BIT(16))
#define ADC_DMA_EOF_NUM_CLR_M  (ADC_DMA_EOF_NUM_CLR_V << ADC_DMA_EOF_NUM_CLR_S)
#define ADC_DMA_EOF_NUM_CLR_V  0x00000001U
#define ADC_DMA_EOF_NUM_CLR_S  16
/** ADC_APB_ADC_TRANS : R/W; bitpos: [31]; default: 0;
 *  enable apb_adc use spi_dma
 */
#define ADC_APB_ADC_TRANS    (BIT(31))
#define ADC_APB_ADC_TRANS_M  (ADC_APB_ADC_TRANS_V << ADC_APB_ADC_TRANS_S)
#define ADC_APB_ADC_TRANS_V  0x00000001U
#define ADC_APB_ADC_TRANS_S  31

/** ADC_REF_CONTROL_REG register
 *  Register
 */
#define ADC_REF_CONTROL_REG (DR_REG_ADC_BASE + 0x78)
/** ADC_RTC_REF_DELAY : R/W; bitpos: [29]; default: 0;
 *  control the refgen short vdd
 */
#define ADC_RTC_REF_DELAY    (BIT(29))
#define ADC_RTC_REF_DELAY_M  (ADC_RTC_REF_DELAY_V << ADC_RTC_REF_DELAY_S)
#define ADC_RTC_REF_DELAY_V  0x00000001U
#define ADC_RTC_REF_DELAY_S  29
/** ADC_RTC_PRE_CHARGE : R/W; bitpos: [30]; default: 0;
 *  control the refgen module pre charge
 */
#define ADC_RTC_PRE_CHARGE    (BIT(30))
#define ADC_RTC_PRE_CHARGE_M  (ADC_RTC_PRE_CHARGE_V << ADC_RTC_PRE_CHARGE_S)
#define ADC_RTC_PRE_CHARGE_V  0x00000001U
#define ADC_RTC_PRE_CHARGE_S  30
/** ADC_RTC_XPD_REFGEN : R/W; bitpos: [31]; default: 0;
 *  control the refgen module power up
 */
#define ADC_RTC_XPD_REFGEN    (BIT(31))
#define ADC_RTC_XPD_REFGEN_M  (ADC_RTC_XPD_REFGEN_V << ADC_RTC_XPD_REFGEN_S)
#define ADC_RTC_XPD_REFGEN_V  0x00000001U
#define ADC_RTC_XPD_REFGEN_S  31

